【インターンシップ体験レポート】

１．インターンシップで行ったプロジェクト内容
　　　課題：PHP及びSQLを用いたWebアプリケーションの制作（Instagramもどきの制作）

２．プロジェクトで工夫／苦労した点
　　　WindowsOSによるDocker及びLaravelの環境構築に苦労した。解決方法として、WindowsOSに　　依存しない環境をVagrantによって構築し、その仮想空間内でDocker及びLaravelの環境を構築し　　た。
　　　Webアプリケーションの開発がほぼ初めてという状況で、開発環境の構築やWebアプリケー　　　ションについて、PHPやSQL・HTMLやCSSなどの書き方など、慣れない環境に苦労した。しか　　　し、試行錯誤を繰り返したり、メンターさんや同チームのメンバーに聞いたりするなどし、１つ　　形のあるものに仕上げることができた。

３．プロジェクトで得られたこと／学んだこと
　　　Webアプリケーションの開発について、本当に多くのことを学んだ。その中でも、特に印象的　　だったのが、MVCモデルを意識したコーディングである。僕の中で今までになかったコーディン　　グ方法であり、とてもわかりやすく、これからはMVCモデルを意識しながらコーディングしてい　　きたいと感じた。
　　　プログラミング言語についてはもちろん、プログラミングをするための知識についても非常に　　多くのことを学び、得ることができ、非常に有意義であった。

４．プロジェクトの感想
　　　Webアプリケーションを開発するための環境構築にこれほどまでに苦労したことはなく、いい　　経験ではあったが、正直、立ち上がりでここまで苦労するとは思わず、挫折しそうになった。し　　かし、少しずつでも作業を進めていく中で、環境構築について、PHPやHTMLなどのプログラミ　　ング言語について、プログラミングの進め方・コードの書き方についてなど、本当に様々でため　　になる経験ばかりで、とても楽しかったというのが素直な感想である。
　　　また、周りの人々のレベルの高さに圧倒される日々であり、とても刺激的なインターンシップ　　であった。そこから学ぶこと、得られることも非常に多く、このインターンシップが人生におけ　　るターニングポイントといっても過言ではないほど貴重な経験をすることができたと感じてい　　　る。今後の進路についても考えさせられることがあり、とても有意義なインターンシップであっ　　たと感じる。

５．インターンシップ全体の感想
　　　交通費・宿泊費が全額、負担していただけることに加え、インターンシップ中は日当が出るこ　　とにも感謝である。個人的に、毎日、新しいことを学び、経験できたうえに、お金までもらえる　　という環境に感謝しかない。また、メンターさんの中に同郷の方がおり、個人的に嬉しかった。　　メンターさんとの距離感も近すぎず遠すぎずフランクな感じがとてもちょうどよかった。
　　　強いて欠点を挙げるならば、メンターさんと深く話せる時間（昼食休憩では少し短いと感じ　　　た）があればうれしいなと感じた。また、勤務時間が朝方であるほうが好きなので、勤務時間の　　自由度の少し欲しかったと感じた。あと、チームラボについて（職種、業務内容、採用情報な　　　ど）が知れると嬉しかった。


６．チームラボインターンおすすめ度
　　［６点］　理由：個人的にはめちゃくちゃ最高なインターンであった。本当に様々な知識が身に　　　　　　　　　　付き、体験や経験ができ、文句なしのインターンであった。しかし、周りのレ　　　　　　　　　　ベルや研修内容の高さは非常に高いと感じ、そのレベルについていける能力や　　　　　　　　　　スキル、メンタルは必須だとも感じた。そのため、限られた人にしかお勧めで　　　　　　　　　　きないという点で少し低めの点数とした。
